<!-- terraform-output powerdey -->
#### Terraform Format and Style for powerdey 🖌`success`

#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```
terraform
data.google_project.default: Reading...
data.google_project.default: Read complete after 0s [id=projects/powerdey]
module.bigquery.google_bigquery_dataset.main: Refreshing state... [id=projects/powerdey/datasets/power_records]
module.bigquery.google_bigquery_table.main["trends"]: Refreshing state... [id=projects/powerdey/datasets/power_records/tables/trends]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.bigquery.google_bigquery_dataset.main will be updated in-place
  ~ resource "google_bigquery_dataset" "main" {
      - default_table_expiration_ms     = 86400000 -> null
        id                              = "projects/powerdey/datasets/power_records"
        # (13 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.bigquery.google_bigquery_table.main["trends"] will be created
  + resource "google_bigquery_table" "main" {
      + clustering          = []
      + creation_time       = (known after apply)
      + dataset_id          = "power_records"
      + deletion_protection = false
      + etag                = (known after apply)
      + expiration_time     = (known after apply)
      + friendly_name       = "trends"
      + id                  = (known after apply)
      + last_modified_time  = (known after apply)
      + location            = (known after apply)
      + num_bytes           = (known after apply)
      + num_long_term_bytes = (known after apply)
      + num_rows            = (known after apply)
      + project             = "powerdey"
      + schema              = jsonencode(
            [
              + {
                  + description = "Power on"
                  + mode        = "REQUIRED"
                  + name        = "on"
                  + type        = "BOOL"
                },
              + {
                  + description = "Date record was made"
                  + mode        = "REQUIRED"
                  + name        = "recorded_at"
                  + type        = "DATETIME"
                },
              + {
                  + description = "Unique device id"
                  + mode        = "REQUIRED"
                  + name        = "device_id"
                  + type        = "STRING"
                },
            ]
        )
      + self_link           = (known after apply)
      + table_id            = "trends"
      + type                = (known after apply)

      + time_partitioning {
          + expiration_ms            = (known after apply)
          + require_partition_filter = false
          + type                     = "DAY"
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @Azuka, Action: `pull_request`*